#!/bin/bash

command -v jq >/dev/null || {
  echo "install jq" >&2 && exit 1
}

{ [ "$#" -eq 1 ] && [ -f "$1" ]; } || {
  echo "./fixjson.sh <kdb.json>" >&2 && exit 1
}

jq '
  [[.[]|.|={
    "科目番号":       .[0],
    "科目名":         .[1],
    "授業方法":       .[2],
    "単位":           .[3],
    "年次":           .[4],
    "学期":           .[5],
    "曜時限":         .[6],
    "教室":           .[7],
    "担当教員":       .[8],
    "概要":           .[9],
    "備考":           .[10],
    "データ更新日時": .[11],
    "要件":           .[12],
    "開設団体":       .[13]
  }]|to_entries[]|.value + {"科目ID": .key}]' "$1"
